export interface Quest {
  id: number;
  title: string;
  point: { x: number; z: number };
  riddle: string;
  successMessage: string;
  status: "locked" | "active" | "completed";
  trigger?: "phonecall" | "direct";
  caller?: string;
}

export const quests: Quest[] = [
  {
    id: 1,
    title: "The First Spark",
    point: { x: 20, z: -15 },
    riddle:
      "Το βράδυ ανάψαμε φωτιά\nΚαι τραγουδούσαμε γύρω τριγύρω:\nΦωτιά ωραία φωτιά μη λυπηθείς τα κούτσουρα\nΦωτιά ωραία φωτιά μη φτάσεις ως τη στάχτη\nΦωτιά ωραία φωτιά καίγε μας\nλέγε μας τη ζωή.",
    successMessage:
      "Τα πάρκα της πόλης θα πρέπει να είναι καθαρισμένα από πεσμένα κούτσουρα, κλαδιά και ξερά φύλλα! Ευτυχώς, έσβησες άμεσα την πρώτη φωτιά!",
    status: "locked",
    trigger: "phonecall",
    caller: "Βαθιά Φωνή",
  },
  {
    id: 2,
    title: "The Red Herring",
    point: { x: 50, z: 40 },
    riddle:
      "Υπάρχουν πολλά κόκκινα που κινούνται παντού, αλλά εσύ ψάχνεις αυτό που βρίσκεται πιο ανατολικά από τα υπόλοιπα.",
    successMessage:
      "Εξαιτίας της διαρροής βενζίνης, το αυτοκίνητο πήρε φωτιά! Άλλη μια εστία φωτιάς που κατάφερες να σβήσεις!",
    status: "locked",
    trigger: "direct",
  },
  {
    id: 3,
    title: "A Burning Problem",
    point: { x: -30, z: -30 },
    riddle:
      "Κάνει ζημιά στην υγεία του ανθρώπου και όχι μόνο. Αν το πετάξει κάποιος εκεί μέσα, μπορεί να κάψει ολόκληρη την πόλη!",
    successMessage:
      "Κάποιος/α ασυνείδητος/η πέταξε μια γόπα από τσιγάρο μέσα στον σκουπιδοτενεκέ. Ευτυχώς, πρόλαβες τα χειρότερα!",
    status: "locked",
    trigger: "direct",
  },
  {
    id: 4,
    title: "Unlucky Number",
    point: { x: -10, z: 50 },
    riddle: "Μην ποντάρεις ποτέ στο νούμερο 15! Θα φέρει την καταστροφή στην πόλη!",
    successMessage:
      "Έφτασες γρήγορα και έσωσες τους ανθρώπους που κουνούσαν μαντίλια στα παράθυρα της πολυκατοικίας. Η φωτιά είχε ξεσπάσει από μια ηλεκτρική κουζίνα που ο ιδιοκτήτης ξέχασε αναμμένη.",
    status: "locked",
    trigger: "direct",
  },
  {
    id: 5,
    title: "Race Against Time",
    point: { x: 0, z: 0 },
    riddle:
      "Η ώρα πήγε 5… Μήπως άργησες να προλάβεις την τελευταία εστία φωτιάς; Τρέξε για να δραπετεύσεις από τη φωτιά!",
    successMessage:
      "Μπράβο σου! Κατάφερες να σβήσεις μέχρι και την τελευταία εστία φωτιάς που είχε ξεσπάσει στο Δημαρχείο. Η φωτιά ξεκίνησε από ένα βραχυκύκλωμα στο αρχείο του Δημαρχείου. Γλίτωσες την πόλη από αστική πυρκαγιά! Η εκπαίδευσή σου άξιζε τον κόπο!!!!",
    status: "locked",
    trigger: "direct",
  },
];
