export interface Quest {
  id: number;
  title: string;
  riddle: string;
  correctAnswer: number;
  successMessage: string;
  status: "locked" | "active" | "completed";
}

export const quests: Quest[] = [
  {
    id: 1,
    title: "The First Spark",
    riddle: `Σηκώνεις το ακουστικό. Μια βαθιά φωνή σου απαγγέλει ένα απόσπασμα από το ποίημα του Οδ. Ελύτη «Ήλιος ο Πρώτος». Σε ποιο σημείο της πόλης σε στέλνει η φωνή?

Το βράδυ ανάψαμε φωτιά
Και τραγουδούσαμε γύρω τριγύρω:
Φωτιά ωραία φωτιά μη λυπηθείς τα κούτσουρα
Φωτιά ωραία φωτιά μη φτάσεις ως τη στάχτη
Φωτιά ωραία φωτιά καίγε μας
λέγε μας τη ζωή.`,
    correctAnswer: 6,
    successMessage:
      "Τα πάρκα της πόλης θα πρέπει να είναι καθαρισμένα από πεσμένα κούτσουρα, κλαδιά και ξερά φύλλα! Ευτυχώς, έσβησες άμεσα την πρώτη φωτιά!",
    status: "locked",
  },
  {
    id: 2,
    title: "The Red Car",
    riddle: `Κι ενώ δεν ξέρεις πού να πας, ένας ποδηλάτης περνάει από δίπλα σου και σου δίνει ένα καλοδιπλωμένο χαρτί. Το μήνυμα γράφει:

«Υπάρχουν πολλά κόκκινα που κινούνται παντού, αλλά εσύ ψάχνεις αυτό που βρίσκεται πιο ανατολικά από τα υπόλοιπα.»`,
    correctAnswer: 10,
    successMessage:
      "Εξαιτίας της διαρροής βενζίνης, το αυτοκίνητο πήρε φωτιά! Άλλη μια εστία φωτιάς που κατάφερες να σβήσεις!",
    status: "locked",
  },
  {
    id: 3,
    title: "The Trash Fire",
    riddle: `Ακούς τον ήχο του συναγερμού… Στο κινητό σου έρχεται το ακόλουθο μήνυμα:

«Κάνει ζημιά στην υγεία του ανθρώπου και όχι μόνο. Αν το πετάξει κάποιος εκεί μέσα, μπορεί να κάψει ολόκληρη την πόλη!»`,
    correctAnswer: 8,
    successMessage:
      "Κάποιος/α ασυνείδητος/η πέταξε μια γόπα από τσιγάρο μέσα στον σκουπιδοτενεκέ. Ευτυχώς, πρόλαβες τα χειρότερα!",
    status: "locked",
  },
  {
    id: 4,
    title: "Fifteen's Demise",
    riddle: `Στην ψηφιακή αφίσα διαφημίσεων παρουσιάζεται το μήνυμα:

Μην ποντάρεις ποτέ στο νούμερο 15! Θα φέρει την καταστροφή στην πόλη!`,
    correctAnswer: 5,
    successMessage:
      "Έφτασες γρήγορα και έσωσες τους ανθρώπους που κουνούσαν μαντίλια στα παράθυρα της πολυκατοικίας. Η φωτιά είχε ξεσπάσει από μια ηλεκτρική κουζίνα που ο ιδιοκτήτης ξέχασε αναμμένη.",
    status: "locked",
  },
  {
    id: 5,
    title: "The Final Countdown",
    riddle:
      "Η ώρα πήγε 5… Μήπως άργησες να προλάβεις την τελευταία εστία φωτιάς; Τρέξε για να δραπετεύσεις από τη φωτιά!",
    correctAnswer: 9,
    successMessage:
      "Μπράβο σου! Κατάφερες να σβήσεις μέχρι και την τελευταία εστία φωτιάς που είχε ξεσπάσει στο Δημαρχείο. Η φωτιά ξεκίνησε από ένα βραχυκύκλωμα στο αρχείο του Δημαρχείου. Γλίτωσες την πόλη από αστική πυρκαγιά! Η εκπαίδευσή σου άξιζε τον κόπο!!!!",
    status: "locked",
  },
];
